CSI API ETABS v1
cGridSys.GetGridSysType Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGridSysType(
	string Name,
	ref string GridSysType
)
Function GetGridSysType (
	Name As String,
	ByRef GridSysType As String
) As Integer
Dim instance As cGridSys
Dim Name As String
Dim GridSysType As String
Dim returnValue As Integer
returnValue = instance.GetGridSysType(Name,
	GridSysType)
int GetGridSysType(
	String^ Name,
	String^% GridSysType
)
abstract GetGridSysType :
        Name : string *
        GridSysType : string byref -> int
Parameters
Name
Type: System.String
GridSysType
Type: System.String
Return Value
Type: Int32
See Also
Reference
cGridSys Interface
ETABSv1 Namespace